# ============================================================
# Error Messages - Japanese
# ============================================================

# === Global ===
error.auth.required=\u8a8d\u8a3c\u304c\u5fc5\u8981\u3067\u3059\u3002\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304b\u3089\u518d\u5ea6\u304a\u8a66\u3057\u304f\u3060\u3055\u3044\u3002
error.moderation.inappropriate_image=\u4e0d\u9069\u5207\u306a\u753b\u50cf\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
error.rate_limit.exceeded=\u30ea\u30af\u30a8\u30b9\u30c8\u304c\u591a\u3059\u304e\u307e\u3059\u3002\u3057\u3070\u3089\u304f\u3057\u3066\u304b\u3089\u518d\u5ea6\u304a\u8a66\u3057\u304f\u3060\u3055\u3044\u3002
error.locale.unsupported=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u8a00\u8a9e\u3067\u3059\u3002
error.timezone.unsupported=\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30bf\u30a4\u30e0\u30be\u30fc\u30f3\u3067\u3059\u3002

# === Image (shared) ===
error.image.empty=\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u3059\u308b\u753b\u50cf\u30d5\u30a1\u30a4\u30eb\u304c\u3042\u308a\u307e\u305b\u3093\u3002
error.image.invalid=\u7121\u52b9\u306a\u753b\u50cf\u30d5\u30a1\u30a4\u30eb\u3067\u3059\u3002
error.image.save_failed=\u753b\u50cf\u306e\u4fdd\u5b58\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

# === User Service ===
error.user.not_found=\u30e6\u30fc\u30b6\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.user.withdrawn=\u3053\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u9000\u4f1a\u6e08\u307f\u3067\u3059\u3002
error.nickname.already_in_use=\u3053\u306e\u30cb\u30c3\u30af\u30cd\u30fc\u30e0\u306f\u65e2\u306b\u4f7f\u7528\u3055\u308c\u3066\u3044\u307e\u3059\u3002
error.signup.token_invalid=\u4f1a\u54e1\u767b\u9332\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3059\u3002\u518d\u5ea6\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.signup.token_expired=\u4f1a\u54e1\u767b\u9332\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6709\u52b9\u671f\u9650\u304c\u5207\u308c\u307e\u3057\u305f\u3002\u518d\u5ea6\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.signup.already_completed=\u3053\u306e\u30a2\u30ab\u30a6\u30f3\u30c8\u306f\u65e2\u306b\u767b\u9332\u304c\u5b8c\u4e86\u3057\u3066\u3044\u307e\u3059\u3002
error.nickname.empty=\u30cb\u30c3\u30af\u30cd\u30fc\u30e0\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.nickname.too_short=\u30cb\u30c3\u30af\u30cd\u30fc\u30e0\u306f2\u6587\u5b57\u4ee5\u4e0a\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.nickname.too_long=\u30cb\u30c3\u30af\u30cd\u30fc\u30e0\u306f10\u6587\u5b57\u4ee5\u4e0b\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.nickname.invalid_chars=\u30cb\u30c3\u30af\u30cd\u30fc\u30e0\u306b\u306f\u97d3\u56fd\u8a9e\u3001\u82f1\u8a9e\u3001\u6570\u5b57\u3001\u30a2\u30e9\u30d3\u30a2\u8a9e\u306e\u307f\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002
error.bio.too_long=\u81ea\u5df1\u7d39\u4ecb\u306f200\u6587\u5b57\u4ee5\u4e0b\u3067\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.profile.invalid_image=\u7121\u52b9\u306a\u753b\u50cf\u30d5\u30a1\u30a4\u30eb\u3067\u3059\u3002\uff08\u5bfe\u5fdc: jpg, jpeg, png, gif, webp / \u6700\u59275MB\uff09
error.terms.not_found=\u5229\u7528\u898f\u7d04\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.terms.duplicate_code=\u3053\u306e\u5229\u7528\u898f\u7d04\u30b3\u30fc\u30c9\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
error.terms.version.not_found=\u5229\u7528\u898f\u7d04\u30d0\u30fc\u30b8\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.terms.version.duplicate=\u3053\u306e\u30d0\u30fc\u30b8\u30e7\u30f3\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002

# === Guild Service ===
error.guild.not_found=\u30ae\u30eb\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.guild.post.not_found=\u6295\u7a3f\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.guild.post.not_deleted=\u3053\u306e\u6295\u7a3f\u306f\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
error.guild.comment.not_found=\u30b3\u30e1\u30f3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.guild.comment.not_deleted=\u3053\u306e\u30b3\u30e1\u30f3\u30c8\u306f\u524a\u9664\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002

# === Mission Service ===
error.mission.not_found=\u30df\u30c3\u30b7\u30e7\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.mission.comment.not_found=\u30b3\u30e1\u30f3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.mission.comment.wrong_mission=\u3053\u306e\u30b3\u30e1\u30f3\u30c8\u306f\u3053\u306e\u30df\u30c3\u30b7\u30e7\u30f3\u306b\u5c5e\u3057\u3066\u3044\u307e\u305b\u3093\u3002
error.mission.comment.not_owner=\u81ea\u5206\u306e\u30b3\u30e1\u30f3\u30c8\u306e\u307f\u524a\u9664\u3067\u304d\u307e\u3059\u3002
error.mission.template.not_found=\u30df\u30c3\u30b7\u30e7\u30f3\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.mission.cannot_delete_in_progress=\u9032\u884c\u4e2d\u306e\u53c2\u52a0\u8005\u304c\u3044\u308b\u305f\u3081\u30df\u30c3\u30b7\u30e7\u30f3\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3002\u3059\u3079\u3066\u5b8c\u4e86\u307e\u305f\u306f\u30ad\u30e3\u30f3\u30bb\u30eb\u5f8c\u306b\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.mission.cannot_withdraw_in_progress=\u9032\u884c\u4e2d\u306e\u30df\u30c3\u30b7\u30e7\u30f3\u304c\u3042\u308b\u305f\u3081\u3001\u64a4\u56de\u3067\u304d\u307e\u305b\u3093\u3002\u5b8c\u4e86\u307e\u305f\u306f\u30ad\u30e3\u30f3\u30bb\u30eb\u5f8c\u306b\u518d\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# === Feed Service ===
error.feed.not_found=\u30d5\u30a3\u30fc\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.feed.self_like=\u81ea\u5206\u306e\u30d5\u30a3\u30fc\u30c9\u306b\u306f\u300c\u3044\u3044\u306d\u300d\u3067\u304d\u307e\u305b\u3093\u3002
error.feed.comment.not_found=\u30b3\u30e1\u30f3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.feed.comment.wrong_feed=\u3053\u306e\u30b3\u30e1\u30f3\u30c8\u306f\u3053\u306e\u30d5\u30a3\u30fc\u30c9\u306b\u5c5e\u3057\u3066\u3044\u307e\u305b\u3093\u3002
error.feed.comment.not_owner=\u81ea\u5206\u306e\u30b3\u30e1\u30f3\u30c8\u306e\u307f\u524a\u9664\u3067\u304d\u307e\u3059\u3002
error.feed.not_owner=\u81ea\u5206\u306e\u30d5\u30a3\u30fc\u30c9\u306e\u307f\u524a\u9664\u3067\u304d\u307e\u3059\u3002
error.feed.access_denied=\u3053\u306e\u30d5\u30a3\u30fc\u30c9\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u307e\u305b\u3093\u3002

# === Gamification Service ===
error.season.not_found=\u30b7\u30fc\u30ba\u30f3\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.season.no_active=\u73fe\u5728\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30b7\u30fc\u30ba\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
error.season.end_before_start=\u7d42\u4e86\u65e5\u306f\u958b\u59cb\u65e5\u3088\u308a\u5f8c\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
error.season.overlap=\u3053\u306e\u671f\u9593\u306b\u306f\u65e2\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30b7\u30fc\u30ba\u30f3\u304c\u5b58\u5728\u3057\u307e\u3059\u3002
error.season.reward.not_found=\u5831\u916c\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.season.rank.invalid_range=\u958b\u59cb\u30e9\u30f3\u30af\u306f\u7d42\u4e86\u30e9\u30f3\u30af\u3088\u308a\u5927\u304d\u304f\u3067\u304d\u307e\u305b\u3093\u3002
error.season.rank.overlap=\u30e9\u30f3\u30af\u7bc4\u56f2\u304c\u65e2\u5b58\u306e\u5831\u916c\u3068\u91cd\u8907\u3057\u3066\u3044\u307e\u3059\u3002
error.title.not_found=\u79f0\u53f7\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.title.duplicate_name=\u3053\u306e\u79f0\u53f7\u540d\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
error.event.not_found=\u30a4\u30d9\u30f3\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.event.end_before_start=\u7d42\u4e86\u65e5\u306f\u958b\u59cb\u65e5\u3088\u308a\u5f8c\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
error.achievement.not_found=\u696d\u7e3e\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.achievement.category.not_found=\u696d\u7e3e\u30ab\u30c6\u30b4\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.achievement.category.duplicate_code=\u3053\u306e\u30ab\u30c6\u30b4\u30ea\u30b3\u30fc\u30c9\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
error.achievement.category.has_achievements=\u3053\u306e\u30ab\u30c6\u30b4\u30ea\u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u696d\u7e3e\u304c\u3042\u308a\u307e\u3059\u3002\u5148\u306b\u524a\u9664\u307e\u305f\u306f\u518d\u5272\u308a\u5f53\u3066\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.checklogic.not_found=\u30c1\u30a7\u30c3\u30af\u30ed\u30b8\u30c3\u30af\u30bf\u30a4\u30d7\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.checklogic.duplicate_code=\u3053\u306e\u30b3\u30fc\u30c9\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002

# === Meta Service ===
error.category.not_found=\u30ab\u30c6\u30b4\u30ea\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.category.duplicate=\u30ab\u30c6\u30b4\u30ea\u540d\u304c\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
error.attendance_reward.not_found=\u51fa\u5e2d\u5831\u916c\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.attendance_reward.duplicate_type=\u3053\u306e\u5831\u916c\u30bf\u30a4\u30d7\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
error.guild_level.not_found=\u30ae\u30eb\u30c9\u30ec\u30d9\u30eb\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.guild_level.duplicate=\u3053\u306e\u30ae\u30eb\u30c9\u30ec\u30d9\u30eb\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002
error.user_level.not_found=\u30ec\u30d9\u30eb\u8a2d\u5b9a\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.user_level.duplicate=\u3053\u306e\u30ec\u30d9\u30eb\u306f\u65e2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002

# === Profanity ===
error.profanity.detected=\u4e0d\u9069\u5207\u306a\u8868\u73fe\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
error.profanity.not_found=\u7981\u6b62\u8a9e\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
error.profanity.duplicate=\u3053\u306e\u5358\u8a9e\u306f\u65e2\u306b\u767b\u9332\u3055\u308c\u3066\u3044\u307e\u3059\u3002

# === Support Service ===
error.report.failed=\u5831\u544a\u306e\u9001\u4fe1\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u3057\u3070\u3089\u304f\u3057\u3066\u304b\u3089\u518d\u5ea6\u304a\u8a66\u3057\u304f\u3060\u3055\u3044\u3002
error.inquiry.create_failed=\u304a\u554f\u3044\u5408\u308f\u305b\u306e\u9001\u4fe1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
error.inquiry.list_failed=\u304a\u554f\u3044\u5408\u308f\u305b\u4e00\u89a7\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
error.inquiry.read_failed=\u304a\u554f\u3044\u5408\u308f\u305b\u306e\u8aad\u307f\u8fbc\u307f\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002

# === Kakao Webhook ===
error.kakao.invalid_auth_header=\u7121\u52b9\u306a\u8a8d\u8a3c\u30d8\u30c3\u30c0\u30fc\u5f62\u5f0f\u3067\u3059
error.kakao.invalid_admin_key=\u7121\u52b9\u306a\u7ba1\u7406\u8005\u30ad\u30fc\u3067\u3059
error.kakao.invalid_app_id=\u7121\u52b9\u306a\u30a2\u30d7\u30eaID\u3067\u3059
